coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_rtc.c
    tmp &= HOURR_HO5_SET;

    if (tmp == HOURR_HO5_SET) {
        mode = RTC_PM_MODE;
    } else {
        mode = RTC_AM_MODE;
    }

    return (mode);
}

/**
  * @brief  Set hour value in 24 Hour mode.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Hour: New hour value, max 23
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...23 
  * @retval None
  */
void RTC_SetHour24(RTC_FuncMode NewMode, uint8_t Hour)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_HOUR_24(Hour));
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Hour / 10U) * 16U + Hour % 10U);
    /* Write hour value into HOURR register */
    TSB_RTC->HOURR = tmp;
}

/**
  * @brief  Set hour value in 12 Hour mode.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Hour: New hour value, max 11
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...11
  * @param  AmPm: New time mode
  *   This parameter can be one of the following values:
  *   RTC_AM_MODE or RTC_PM_MODE
  * @retval None
  */
void RTC_SetHour12(RTC_FuncMode NewMode, uint8_t Hour, uint8_t AmPm)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_HOUR_12(Hour));
    assert_param(IS_RTC_FUNC_MODE(NewMode));
    assert_param(IS_RTC_AMPM_MODE(AmPm));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Hour / 10U) * 16U + Hour % 10U);

    if (AmPm == RTC_PM_MODE) {
        tmp |= HOURR_HO5_SET;
    } else {
        /* Do nothing */
    }

    /* Write hour value into HOURR register */
    TSB_RTC->HOURR = tmp;
}

/**
  * @brief  Get the hour value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The hour value.
  */
uint8_t RTC_GetHour(RTC_FuncMode NewMode)
{
    uint8_t HourMode = 0U;
    uint8_t hour = 0U;
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    /* Get hour mode */
    HourMode = RTC_GetHourMode();
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        /* Get hour value */
        do {
            tmp = TSB_RTC->HOURR;
            hour = TSB_RTC->HOURR;
        }
        while (tmp != hour);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->HOURR;
    }

    if (HourMode == RTC_12_HOUR_MODE) {
        tmp &= HOURR_HO5_CLEAR;
    } else {
        /* Do nothing */
    }

    hour = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return hour value */
    return hour;
}

/**
  * @brief  Set day value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Day: New day value
  *   This parameter can be one of the following values:
  *   RTC_SUN, RTC_MON, RTC_TUE, RTC_WED, RTC_THU, RTC_FRI, RTC_SAT 
  * @retval None
  */
void RTC_SetDay(RTC_FuncMode NewMode, uint8_t Day)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_DAY(Day));
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    /* Write day value into DAYR register */
    TSB_RTC->DAYR = Day;
}

/**
  * @brief  Get day value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The day value.
  */
uint8_t RTC_GetDay(RTC_FuncMode NewMode)
{
    uint8_t day = 0U;
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        /* Get day value */
        do {
            tmp = TSB_RTC->DAYR;
            day = TSB_RTC->DAYR;
        }
        while (tmp != day);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        day = TSB_RTC->DAYR;
    }

    /* return day value  */
    return day;
}

/**
  * @brief  Set date value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Date: New date value, Max 31
  *   This parameter can be one of the following values:
  *   1, 2, ...31 
  * @retval None
  */
void RTC_SetDate(RTC_FuncMode NewMode, uint8_t Date)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_DATE(Date));
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Date / 10U) * 16U + Date % 10U);
    /* Write date value into DAYR register */
    TSB_RTC->DATER = tmp;
}

/**
  * @brief  Get date value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The date value.
  */
uint8_t RTC_GetDate(RTC_FuncMode NewMode)
{
    uint8_t tmp = 0U;
    uint8_t date = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        /* Get date value */
        do {
            tmp = TSB_RTC->DATER;
            date = TSB_RTC->DATER;
        }
        while (tmp != date);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->DATER;
    }

    date = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return day value  */
    return date;
}

/**
  * @brief  Set month value.
  * @param  Month: New month value, Max 12
  *   This parameter can be one of the following values:
  *   1, 2, 3, ...12 
  * @retval None
  */
void RTC_SetMonth(uint8_t Month)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_MONTH(Month));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Month / 10U) * 16U + Month % 10U);
    /* Write month value into MONTHR register */
    TSB_RTC->MONTHR = tmp;
}

/**
  * @brief  Get month value.
  * @param  None
  * @retval The month value.
  */
uint8_t RTC_GetMonth(void)
{
    uint8_t tmp = 0U;
    uint8_t month = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    /* Get month value */
    do {
        tmp = TSB_RTC->MONTHR;
        month = TSB_RTC->MONTHR;
    }
    while (tmp != month);

    month = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return month value */
    return month;
}

/**
  * @brief  Set year value.
  * @param  Year: New year value, Max 99
  *   This parameter can be one of the following values:
  *   0, 1, 2, 3, ...99
  * @retval None
  */
void RTC_SetYear(uint8_t Year)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_YEAR(Year));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Year / 10U) * 16U + Year % 10U);
    /* Write year value into YEARR register */
    TSB_RTC->YEARR = tmp;
}

/**
  * @brief  Get year value.
  * @param  None
  * @retval The year value.
  */
uint8_t RTC_GetYear(void)
{
    uint8_t tmp = 0U;
    uint8_t year = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

