coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_rtc.c
    /* Get year value */
    do {
        tmp = TSB_RTC->YEARR;
        year = TSB_RTC->YEARR;
    }
    while (tmp != year);

    year = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return year value  */
    return year;
}

/**
  * @brief  Select 24-hour clock or 12-hour clock.
  * @param  HourMode: Select 24-hour clock or 12-hour clock 
  *   This parameter can be one of the following values:
  *   RTC_12_HOUR_MODE, RTC_24_HOUR_MODE
  * @retval None
  */
void RTC_SetHourMode(uint8_t HourMode)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_HOUR_MODE(HourMode));

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Set MONTHR<MO0> to select 24-hour mode/12-hour mode */
#ifdef BIT_BAND
    if (HourMode == RTC_12_HOUR_MODE) {
      
        TSB_RTC_MONTHR_MO0 = (uint32_t) RTC_12_HOUR_MODE;
       
    } else {    
        TSB_RTC_MONTHR_MO0 = (uint32_t) RTC_24_HOUR_MODE;       
    }
#else     
    TSB_RTC->MONTHR = HourMode;        
#endif    
}

/**
  * @brief  Get hour mode.
  * @param  None
  * @retval mode: The mode of the hour.
  *   The return value can be one of the following values:
  *   RTC_12_HOUR_MODE, RTC_24_HOUR_MODE 
  */
uint8_t RTC_GetHourMode(void)
{
    uint8_t mode = 0U;

    /* Select PAGE1 */
    mode = TSB_RTC->PAGER;
    mode &= PAGER_PAGE_CLEAR;
    mode |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = mode;

#ifdef BIT_BAND
    if (TSB_RTC_MONTHR_MO0 == 1U) {
        mode = RTC_24_HOUR_MODE;
    } else {
        mode = RTC_12_HOUR_MODE;
    }
#else
    mode = TSB_RTC->MONTHR&0x01U;
#endif
    return (mode);
}

/**
  * @brief  Set leap-year state.
  * @param  LeapYear: Set leap-year 
  *   This parameter can be one of the following values:
  *   RTC_LEAP_YEAR_0, RTC_LEAP_YEAR_1,
  *   RTC_LEAP_YEAR_2 or RTC_LEAP_YEAR_3 
  * @retval None
  */
void RTC_SetLeapYear(uint8_t LeapYear)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_LEAP_YEAR(LeapYear));

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Set <LEAP1> and <LEAP0> to select leap year state */
    TSB_RTC->YEARR = LeapYear;
}

/**
  * @brief  Get leap-year state.
  * @param  None 
  * @retval The state of leap year.
  */
uint8_t RTC_GetLeapYear(void)
{
    uint8_t tmp = 0U;
    uint8_t leapyear = 0U;

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Get leap year state */
    do {
        tmp = TSB_RTC->YEARR;
        leapyear = TSB_RTC->YEARR;
    }
    while (tmp != leapyear);

    /* return leap year state  */
    return (leapyear);
}

/**
  * @brief  Set time adjustment + or - 30 seconds.
  * @param  None
  * @retval None
  */
void RTC_SetTimeAdjustReq(void)
{
    uint8_t tmp = 0U;

    /* Set PAGER<ADJUST> */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ADJUST_CLEAR;
    tmp |= PAGER_ADJUST_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Get request state for time adjust.
  * @param  None
  * @retval The state of time adjustment.
  *   The return value can be one of the following values:
  *   RTC_REQ or RTC_NO_REQ
  */
RTC_ReqState RTC_GetTimeAdjustReq(void)
{
    uint8_t tmp0 = 0U;
    RTC_ReqState tmp1 = RTC_NO_REQ;

    tmp0 = TSB_RTC->PAGER;
    tmp0 &= PAGER_ADJUST_SET;

    if (tmp0 == PAGER_ADJUST_SET) {
        tmp1 = RTC_REQ;
    } else {
        tmp1 = RTC_NO_REQ;
    }

    return (tmp1);
}

/**
  * @brief  Enable RTC clock function.
  * @param  None
  * @retval None
  */
void RTC_EnableClock(void)
{
    uint8_t tmp = 0U;

    /* Set PAGER<ENATMR> to enable clock function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENATMR_CLEAR;
    tmp |= PAGER_ENATMR_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Disable RTC clock function.
  * @param  None
  * @retval None
  */
void RTC_DisableClock(void)
{
    uint8_t tmp = 0U;

    /* Clear PAGER<ENATMR> to disable clock function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENATMR_CLEAR;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Enable RTC alarm function.
  * @param  None
  * @retval None
  */
void RTC_EnableAlarm(void)
{
    uint8_t tmp = 0U;

    /* Set PAGER<ENAALM> to enable alarm function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENAALM_CLEAR;
    tmp |= PAGER_ENAALM_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Disable RTC alarm function.
  * @param  None
  * @retval None
  */
void RTC_DisableAlarm(void)
{
    uint8_t tmp = 0U;

    /* Clear PAGER<ENAALM> to disable alarm function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENAALM_CLEAR;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Enable or disable INTRTC.
  * @param  NewState: New state of RTCINT.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void RTC_SetRTCINT(FunctionalState NewState)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Set PAGER<INTENA> to enable or disable INTRTC */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_INTENA_CLEAR;

    if (NewState == ENABLE) {
        tmp |= PAGER_INTENA_SET;
    } else {
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Set output signals from ALARM pin.
  * @param  Output: Set ALARM pin output.
  *   This parameter can be RTC_LOW_LEVEL, RTC_PULSE_1_HZ
  *   or RTC_PULSE_16_HZ,RTC_PULSE_2_HZ,RTC_PULSE_4_HZ,RTC_PULSE_8_HZ.
  * @retval None
  */
void RTC_SetAlarmOutput(uint8_t Output)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_ALARM_OUTPUT(Output));

    switch (Output) {
    case RTC_LOW_LEVEL:
        /* Set PAGER<ENAALM> = 1 to enable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        tmp |= PAGER_ENAALM_SET;
        TSB_RTC->PAGER = tmp;
        /* Set All DIS bits = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= RESTR_DIS_SET;
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_1_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS1HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_16_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS16HZ> = 0 and others DIS bit = 1 */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS1HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_2_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS2HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS1HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_4_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS4HZ> = 0 and others DIS bit = 1 */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS1HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_8_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS8HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS1HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    default:
        /* do nothing */
        break;
    }
}

/**
  * @brief  Reset RTC clock second counter.
  * @param  None
  * @retval None
  */
void RTC_ResetClockSec(void)
{
    uint8_t tmp = 0U;

