coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_rtc.c
    /* Set RESTR<RSTTMR> = 1 to reset clock sec counter */
    tmp = TSB_RTC->RESTR;
    tmp &= RESTR_RSTTMR_CLEAR;
    tmp |= RESTR_RSTTMR_SET;
    TSB_RTC->RESTR = tmp;
}

/**
  * @brief  Get request state for reset RTC clock second counter.
  * @param  None
  * @retval The state of reset clock request.
  *   The return value can be one of the following values:
  *   RTC_REQ or RTC_NO_REQ
  */
RTC_ReqState RTC_GetResetClockSecReq(void)
{
    uint8_t tmp0 = 0U;
    RTC_ReqState tmp1 = RTC_NO_REQ;

    tmp0 = TSB_RTC->RESTR;
    tmp0 &= RESTR_RSTTMR_SET;

    if (tmp0 == RESTR_RSTTMR_SET) {
        tmp1 = RTC_REQ;
    } else {
        tmp1 = RTC_NO_REQ;
    }

    return (tmp1);
}

/**
  * @brief  Reset RTC alarm.
  * @param  None
  * @retval None
  */
void RTC_ResetAlarm(void)
{
    uint8_t tmp = 0U;

    /* Set RESTR<RSTALM> = 1 to reset alarm */
    tmp = TSB_RTC->RESTR;
    tmp &= RESTR_RSTALM_CLEAR;
    tmp |= RESTR_RSTALM_SET;
    TSB_RTC->RESTR = tmp;
}

/**
  * @brief  Set the RTC date.
  * @param  DateStruct: The structure containing basic Date configuration.
  * @retval None
  */
void RTC_SetDateValue(RTC_DateTypeDef * DateStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(DateStruct));
    assert_param(IS_RTC_LEAP_YEAR(DateStruct->LeapYear));
    assert_param(IS_RTC_YEAR(DateStruct->Year));
    assert_param(IS_RTC_MONTH(DateStruct->Month));
    assert_param(IS_RTC_DATE(DateStruct->Date));
    assert_param(IS_RTC_DAY(DateStruct->Day));

    /* Set LeapYear */
    RTC_SetLeapYear(DateStruct->LeapYear);
    /* Set year value */
    RTC_SetYear(DateStruct->Year);
    /* Set month value */
    RTC_SetMonth(DateStruct->Month);
    /* Set date value */
    RTC_SetDate(RTC_CLOCK_MODE, DateStruct->Date);
    /* Set day value */
    RTC_SetDay(RTC_CLOCK_MODE, DateStruct->Day);
}

/**
  * @brief  Get the RTC date.
  * @param  DateStruct: The structure containing basic Date configuration will be modified.
  * @retval None
  */
void RTC_GetDateValue(RTC_DateTypeDef * DateStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(DateStruct));

    /* Get LeapYear */
    DateStruct->LeapYear = RTC_GetLeapYear();
    /* Get year value */
    DateStruct->Year = RTC_GetYear();
    /* Get month value */
    DateStruct->Month = RTC_GetMonth();
    /* Get date value */
    DateStruct->Date = RTC_GetDate(RTC_CLOCK_MODE);
    /* Get day value */
    DateStruct->Day = RTC_GetDay(RTC_CLOCK_MODE);
}

/**
  * @brief  Set the RTC time.
  * @param  TimeStruct: The structure containing basic Time configuration.
  * @retval None
  */
void RTC_SetTimeValue(RTC_TimeTypeDef * TimeStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(TimeStruct));
    assert_param(IS_RTC_HOUR_MODE(TimeStruct->HourMode));

    if (TimeStruct->HourMode) {
        assert_param(IS_RTC_HOUR_24(TimeStruct->Hour));
    } else {
        assert_param(IS_RTC_HOUR_12(TimeStruct->Hour));
        assert_param(IS_RTC_AMPM_MODE(TimeStruct->AmPm));
    }

    assert_param(IS_RTC_MINUTE(TimeStruct->Min));
    assert_param(IS_RTC_SECOND(TimeStruct->Sec));

    /* Set hour mode */
    RTC_SetHourMode(TimeStruct->HourMode);

    /* Set hour value */
    if (TimeStruct->HourMode == RTC_24_HOUR_MODE) {
        RTC_SetHour24(RTC_CLOCK_MODE, TimeStruct->Hour);
    } else {
        RTC_SetHour12(RTC_CLOCK_MODE, TimeStruct->Hour, TimeStruct->AmPm);
    }

    /* Set minute value */
    RTC_SetMin(RTC_CLOCK_MODE, TimeStruct->Min);
    /* Set second value */
    RTC_SetSec(TimeStruct->Sec);
}

/**
  * @brief  Get the RTC time.
  * @param  TimeStruct: The structure containing basic Time configuration will be modified.
  * @retval None
  */
void RTC_GetTimeValue(RTC_TimeTypeDef * TimeStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(TimeStruct));

    /* Get hour mode */
    TimeStruct->HourMode = RTC_GetHourMode();
    /* Get hour value */
    TimeStruct->Hour = RTC_GetHour(RTC_CLOCK_MODE);

    if (TimeStruct->HourMode == RTC_12_HOUR_MODE) {
        /* Get AM/PM mode */
        TimeStruct->AmPm = RTC_GetAMPM(RTC_CLOCK_MODE);
    } else {
        TimeStruct->AmPm = RTC_AMPM_INVALID;
    }

    /* Get minute value */
    TimeStruct->Min = RTC_GetMin(RTC_CLOCK_MODE);
    /* Get second value */
    TimeStruct->Sec = RTC_GetSec();
}

/**
  * @brief  Set the RTC alarm date and time.
  * @param  AlarmStruct: The structure containing basic alarm configuration.
  * @retval None
  */
void RTC_SetAlarmValue(RTC_AlarmTypeDef * AlarmStruct)
{
    uint8_t HourMode;
    HourMode = RTC_GetHourMode();

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(AlarmStruct));
    assert_param(IS_RTC_DATE(AlarmStruct->Date));
    assert_param(IS_RTC_DAY(AlarmStruct->Day));

    if (HourMode == RTC_24_HOUR_MODE) {
        assert_param(IS_RTC_HOUR_24(AlarmStruct->Hour));
    } else {
        assert_param(IS_RTC_HOUR_12(AlarmStruct->Hour));
        assert_param(IS_RTC_AMPM_MODE(AlarmStruct->AmPm));
    }

    assert_param(IS_RTC_MINUTE(AlarmStruct->Min));

    /* Set date value */
    RTC_SetDate(RTC_ALARM_MODE, AlarmStruct->Date);
    /* Set day value */
    RTC_SetDay(RTC_ALARM_MODE, AlarmStruct->Day);

    /* Set hour value */
    if (HourMode == RTC_12_HOUR_MODE) {
        RTC_SetHour12(RTC_ALARM_MODE, AlarmStruct->Hour, AlarmStruct->AmPm);
    } else {
        RTC_SetHour24(RTC_ALARM_MODE, AlarmStruct->Hour);
    }

    /* Set minute value */
    RTC_SetMin(RTC_ALARM_MODE, AlarmStruct->Min);
}

/**
  * @brief  Get the RTC alarm date and time.
  * @param  AlarmStruct: The structure containing basic alarm configuration will be modified.
  * @retval None
  */
void RTC_GetAlarmValue(RTC_AlarmTypeDef * AlarmStruct)
{
    uint8_t HourMode;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(AlarmStruct));

    HourMode = RTC_GetHourMode();

    /* Get date value */
    AlarmStruct->Date = RTC_GetDate(RTC_ALARM_MODE);
    /* Get day value */
    AlarmStruct->Day = RTC_GetDay(RTC_ALARM_MODE);
    /* Get hour value */
    AlarmStruct->Hour = RTC_GetHour(RTC_ALARM_MODE);

    if (HourMode == RTC_12_HOUR_MODE) {
        /* Get AM/PM mode */
        AlarmStruct->AmPm = RTC_GetAMPM(RTC_ALARM_MODE);
    } else {
        AlarmStruct->AmPm = RTC_AMPM_INVALID;
    }

