coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_rtc.c
    /* Get minute value */
    AlarmStruct->Min = RTC_GetMin(RTC_ALARM_MODE);
}

/**
  * @brief  Enable or disable write to Clock correction function register.
  * @param  WriteEnableState: New state of write.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
  
void RTC_SetCorrectionProtect(FunctionalState WriteEnableState)
{
    
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(WriteEnableState));
        
    if(WriteEnableState == ENABLE)
    {
       TSB_RTC->PROTECT = WRITE_ENABLE;
    }
    else
    {
        TSB_RTC->PROTECT = WRITE_DISABLE;
    }
}

/**
  * @brief  Enable clock error correction function.
  * @param  None
  * @retval None
  */
void RTC_EnableErrCorrection(void)
{
    uint8_t tmp = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
#ifdef BIT_BAND
    TSB_RTC_ADJCTL_AJEN = 1U;
#else
    TSB_RTC->ADJCTL |= 0x01U;
#endif    
}

/**
  * @brief  Disable clock error correction function.
  * @param  None
  * @retval None
  */
void RTC_DisableErrCorrection(void)
{
    uint8_t tmp = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
#ifdef BIT_BAND
    TSB_RTC_ADJCTL_AJEN = 0U;
#else
    TSB_RTC->ADJCTL &= 0x0EU;
#endif       
}

/**
  * @brief  Configure clock error correction function.
  * @param  Interval: Adjustment interval
  *   This parameter can be one of the following values:
  *   RTC_ADJUST_1_SEC, RTC_ADJUST_10_SEC,RTC_ADJUST_20_SEC, 
  *   RTC_ADJUST_30_SEC,RTC_ADJUST_1_MIN
  * @param  Value: Adjustment value
  *   This parameter can be 0 to 0x1FFFFU(-255 to +255).
  * @retval None
  */
void RTC_ConfigErrCorrection(RTC_AdjustInterval Interval, uint16_t Value)
{
    uint8_t tmp = 0U;
    uint8_t reg = 0U;
    /* Check the parameters */
    assert_param(IS_RTC_ADJUST_INTERVAL(Interval));
    assert_param(IS_RTC_ADJUST_VALUE(Value));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    reg = TSB_RTC->ADJCTL;
    reg &= RTC_ADJCTL_AJSEL_MASK;
    reg |= Interval;
    TSB_RTC->ADJCTL |= reg;
    TSB_RTC->ADJDAT = (uint16_t) (Value&RTC_ADJDAT_MASK);
}
/** @} */
/* End of group RTC_Exported_Functions */

/** @} */
/* End of group RTC */

/** @} */
/* End of group TX00_Periph_Driver */
#endif                          /* defined(__TMPM061_RTC_H) */
